Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/refactoring-omegat.tmx
Source language: en_us
Languages: pt_br

source: Refactoring API
pt_br: API de Refatoração

source: Infrastructure
pt_br: Infra-estrutura

source: Copy file {0}
pt_br: Copiar arquivo {0}

source: Delete file {0}
pt_br: Excluir arquivo {0}

source: Move file {0}
pt_br: Mover arquivo {0}

source: Rename file {0}
pt_br: Renomear arquivo {0}

source: Ref&actor
pt_br: Ref&atorar

source: Refactor
pt_br: Refatorar

source: &Rename...
pt_br: &Renomear...

source: Fi&nd Usages
pt_br: Pr&ocurar utilizações

source: Cop&y...
pt_br: Cop&iar

source: &Safe Delete...
pt_br: Exclusão &segura

source: &Move...
pt_br: &Mover

source: U&ndo
pt_br: Des&fazer

source: Red&o
pt_br: Refa&zer

source: Close Tab
pt_br: Fechar aba

source: Close All Tabs
pt_br: Fechar todas as abas

source: Close Other Tabs
pt_br: Fechar outras abas

source: Preparing usages view
pt_br: Preparando a visualização das utilizações

source: Preparing refactoring preview
pt_br: Preparando a inspeção da refatoração

source: Refactoring...
pt_br: Refatorando...

source: Refactoring Progress
pt_br: Refatoração em andamento

source: Rerun {0}
pt_br: Re-executar {0}

source: Do &Refactoring
pt_br: &Refatorar

source: <No Usages>
pt_br: <Sem utilizações>

source: &Cancel
pt_br: &Cancelar

source: NEEDS REFRESH
pt_br: REQUER ATUALIZAÇÃO

source: Error: this occurrence is in a read-only block of text and cannot be refactored.
pt_br: Erro: esta ocorrência está em um bloco somente leitura de texto e não pode ser refatorado.

source: Error: this occurrence is in a read-only file and cannot be refactored.
pt_br: Erro: esta ocorrência está em um arquivo somente leitura e não pode ser refatorado.

source: occurrence
pt_br: ocorrência

source: occurrences
pt_br: ocorrências

source: errors
pt_br: erros

source: &Find Usages Results
pt_br: Resultados da &pesquisa de utilizações

source: &Refactoring Preview
pt_br: Visualização da &refatoração

source: Perform the prepared refactoring action
pt_br: Executar a ação refatoração preparada

source: Close this window without performing any changes
pt_br: Fechar esta janela sem executar nenhuma alteração

source: Expand all nodes in the tree
pt_br: Expandir todos os nós da árvore

source: Collapse all nodes in the tree
pt_br: Ocultar todos nós na árvore

source: Refresh the refactoring data
pt_br: Atualizar os dados da refatoração

source: Show Logical View
pt_br: Exibir visualização lógica

source: Show Physical View
pt_br: Exibir visualização física

source: Next Occurence - Ctrl+Period
pt_br: Próxima ocorrência - Ctrl+Ponto

source: Previous Occurence - Ctrl+Comma
pt_br: Ocorrência anterior - Ctrl+Vírgula

source: The following warnings and errors were found.
pt_br: Os seguintes avisos e erros foram encontrados.

source: You can continue only with warnings.
pt_br: Você pode continuar apenas com avisos.

source: &List of Errors
pt_br: &Lista de erros

source: Error
pt_br: Erro

source: Warning
pt_br: Aviso

source: Refactoring
pt_br: Refatorar

source: Usages
pt_br: Utilizações

source: Prepare
pt_br: Preparar

source: Update
pt_br: Atualizar

source: Collecting data...
pt_br: Coletando dados...

source: Collecting usages...
pt_br: Coletando utilizações...

source: Initializing data...
pt_br: Inicializando dados...

source: Checking parameters...
pt_br: Verificando parâmetros...

source: Find Usages
pt_br: Procurar utilizações

source: Please Wait...
pt_br: Aguarde...

source: &Refactor
pt_br: &Refatorar

source: Cancel
pt_br: Cancelar

source: < &Back
pt_br: < &Anterior

source: Next >
pt_br: Próximo >

source: &Preview
pt_br: &Visualizar

source: &Find
pt_br: &Localizar

source: &Help
pt_br: Aj&uda

source: Continue anyway?
pt_br: Continuar mesmo assim?

source: Error opening Source Editor.
pt_br: Erro ao abrir Editor de código.

source: There is not enough memory to complete this task.
pt_br: Não há memória suficiente para completar essa tarefa.

source: Source tree is too large.
pt_br: Árvore de código-fonte é muito grande.

source: Please increase -J-Xmx value in your etc/netbeans.conf and restart the IDE.
pt_br: Por favor, acrescente o valor de -J-Xmx em seu etc/netbeans.conf e reinicie a IDE.

source: Safe Delete
pt_br: Exclusão segura

source: <Preview not Available>
pt_br: <Visualização não disponível>

source: Module {0} threw {1}.
pt_br: Módulo {0} jogado {1}.

source: Please report a bug againts {0} module and attach your var/log/messages.log.
pt_br: Favor reportar o problema para o módulo {0} e anexar o arquivo var/log/messages.log.

source: File Does Not Exist
pt_br: Arquivo não existe

source: Proposed Refactoring
pt_br: Refatoração sugerida

source: New File
pt_br: Novo arquivo

source: Refactored {0}
pt_br: Refatorado {0}

source: Please wait, classpath scanning in progress...
pt_br: Aguarde, analise no classpath em andamento...

source: Scanning Project Classpaths
pt_br: Lendo classpaths do projeto

source: Cancel {0}
pt_br: Cancelar {0}

source: Java Refactoring
pt_br: Refatoração para Java

source: The original element being refactored is not available.
pt_br: O elemento que está sendo refatorado não está disponível.

source: It was deleted or significantly changed.
pt_br: Este foi excluído ou alterado significativamente.

source: Usages cannot be collected.
pt_br: Utilizações não podem ser coletadas.

source: Cannot refactor unresolved elements
pt_br: Não é possível refatorar elementos não resolvidos

source: Cannot refactor code that is defined outside of an open project.
pt_br: Não é possível refatorar o código que está definido fora de um projeto aberto.

source: There was an error deleting <b>{0}</b>
pt_br: Ocorreram erros enquanto apagava <b>{0}</b>

source: &Show Usages...
pt_br: Exibir utilizaçõe&s...

source: References to selected elements were found.
pt_br: Referências encontradas para elementos selecionados.

source: Remove all references to these elements in order to safely delete your class.
pt_br: Remova todas referências dos elementos a fim de excluir sua classe com segurança.

source: Safe Delete cannot be invoked from Class/Method References
pt_br: Exclusão Segura não pode ser chamada de Referências de Classe/Método

source: Safe Delete can be invoked only on a Method, Field or Class
pt_br: Exclusão segura pode ser chamada apenas em um Método, Campo ou Classe

source: The selected method cannot be safely deleted since it implements an abstract method {0}.
pt_br: O método selecionado não pode ter exclusão segura desde que ele implemente um método abstrado {0}.

source: Create interface <b>{0}</b>.
pt_br: Criar interface <b>{0}</b>.

source: Create declaration of method <b>{0}</b> in the new interface.
pt_br: Criar declaração de método <b>{0}</b> na nova interface.

source: Move method <b>{0}</b> to the new interface.
pt_br: Mover método <b>{0}</b> para nova interface.

source: Move field <b>{0}</b> to the new interface.
pt_br: Mover campo <b>{0}</b> para a nova interface.

source: Move inner class <b>{0}</b> to the new interface.
pt_br: Mover inner class <b>{0}</b> para a nova interface.

source: Move <b>{0}</b> to the extends clause of the new interface.
pt_br: Mover <b>{0}</b> para a cláusula estendida da nova interface.

source: Add <b>{0}</b> to the implements/extends clause.
pt_br: Adicionar <b>{0}</b> para a cláusula de implementação/estendida.

source: Cannot resolve the element.
pt_br: Não foi possível resolver o elemento.

source: Nothing to extract.
pt_br: Nada a extrair.

source: Method {0} must be public and not static.
pt_br: O método {0} deve ser public e não static.

source: {0} member cannot be extracted.
pt_br: {0} membro não pode ser extraído.

source: The selected type must be a class (cannot perform this operation on an interface, enum or annotation type).
pt_br: O tipo selecionado deve ser uma classe (não pode executar esta operação em uma interface, enum ou tipo de anotação).

source: Member "{0}" cannot be extracted into a super class.
pt_br: Membro "{0}" não pode ser extraído dentro de uma classe super.

source: It does not belong to the source type.
pt_br: Isto não pertence ao tipo de código-fonte.

source: Create class <b>{0}</b>.
pt_br: Criar classe <b>{0}</b>.

source: Create declaration of method <b>{0}</b> in the new super class.
pt_br: Criar declaração de método <b>{0}</b> na nova super classe.

source: Move <b>{0}</b> to the new super class.
pt_br: Mover <b>{0}</b> para a nova super classe.

source: Set <b>{0}</b> to the extend clause.
pt_br: Definir <b>{0}</b> para a cláusula estendida.

source: Cannot pull up any members.
pt_br: Não pode retirar nenhum membro.

source: The selected type has no supertypes in the currently opened projects.
pt_br: O tipo selecionado está sem supertipos no projeto aberto atualmente.

source: The selected type and its supertypes have no members that could be pulled up.
pt_br: O tipo selecionado e estes supertipos não têm membros que possam ser retirados.

source: No members are selected to be pulled up.
pt_br: Nenhum membro foi selecionado para retirar.

source: No supertype is selected.
pt_br: Nenhum supertipo foi selecionado.

source: The target type is not a supertype of the source type, or the source code for the target type is not available.
pt_br: O tipo destino não é um supertipo do tipo de código-fonte, ou o código do código-fonte para o tipo destino não está disponível.

source: Member "{0}" cannot be pulled up.
pt_br: Membro "{0}" não pode ser retirado.

source: It does not belong to the source type or to one of the source type supertypes that are subtypes of the target type.
pt_br: Isto não pertence ao tipo de código-fonte ou a um dos supertipos do tipo de código-fonte que são subtipos do tipo destino.

source: Member "{0}" already exists in the target type.
pt_br: Membro "{0}" já existe no tipo destino.

source: Cannot pull up two members with the same signature.
pt_br: Não pode retirar dois membros com a mesma assinatura.

source: Member "{0}" is being moved to interface, but is not public.
pt_br: Membro "{0}" está sendo movido para interface, mas não é público

source: Add abstract method: <b>{0}</b>
pt_br: Adicionar método abstrato: <b>{0}</b>

source: Move <b>{0}</b> to the target type.
pt_br: Mover <b>{0}</b> para o tipo destino.

source: Copy <b>{0}</b> to the type <b>{1}</b>.
pt_br: Copiar <b>{0}</b> para o tipo <b>{1}</b>.

source: Remove <b>{0}</b> element.
pt_br: Excluir <b>{0}</b> elemento.

source: Make method <b>{0}</b> abstract.
pt_br: Fazer método <b>{0}</b> abstrato.

source: Change modifier from <b>{0}</b> to <b>{1}</b>.
pt_br: Alterar modificador de <b>{0}</b> para <b>{1}</b>.

source: private
pt_br: privado

source: package private
pt_br: pacote privado

source: protected
pt_br: protegido

source: Cannot push down any members.
pt_br: Não pode colocar nenhum membro.

source: The selected type has no subtypes in the currently opened projects.
pt_br: O tipo selecionado está sem subtipos no projeto aberto atualmente.

source: The selected type has no members that could be pushed down.
pt_br: O tipo selecionado não tem membros que possam ser colocados.

source: No members are selected to be pushed down.
pt_br: Nenhum membro está selecioando para ser colocado.

source: {0} already exists in {1}.
pt_br: {0} já existe em {1}.

source: The selected type must be an inner type (cannot perform this operation on a top-level type).
pt_br: O tipo selecionado deve ser um tipo interno (não pode executar esta operação em um tipo de nível superior).

source: Field named <b>{0}</b> already exists in this class.
pt_br: Campo nomeado <b>{0}</b> já existe nessa classe.

source: Inner class named <b>{0}</b> already exists in the target class.
pt_br: Classe interna nomeada <b>{0}</b> já existe na classe destino.

source: The class being moved to the outer level uses members of its outer class.
pt_br: A classe que está sendo movida para o nível externo usa membros desta classe externa.

source: You should let the refactoring create an instance variable holding reference to the original outer class.
pt_br: Você deveria deixar a refatoração criar uma variável instância mantendo referência a classe externa original.

source: One of the super types of the target class already defines an inner class named <b>{0}</b>.
pt_br: Um dos supertipos da classe destino já define uma classe interna nomeada <b>{0}</b>.

source: Make this class an inner class of <b>{0}</b>.
pt_br: Fazer esta classe um classe interna de <b>{0}</b>.

source: Make this class a top-level class.
pt_br: Fazer esta classe uma classe nível máximo.

source: Rename this class to <b>{0}</b>.
pt_br: Renomear esta classe para <b>{0}</b>.

source: Add a new instance field named <b>{0}</b> pointing to the original outer class, update class constructors.
pt_br: Adicionar um novo campo instância nomeado <b>{0}</b> apontando para a classe externa original, atualiza construtores da classe.

source: Add constructor since the default constructor will not be available in the super class.
pt_br: Adicionar construtor desde que o construtor padrão não esteja disponível na super classe.

source: Add explicit constructor invocation since the default constructor will not be available in the super class.
pt_br: Adicionar chamada explícita de construtor desde que o construtor padrão não esteja disponível na super classe.

source: Change from private to package private.
pt_br: Alterar de privado para privado por pacote.

source: Use Supertype of <b>{0}</b> where possible
pt_br: Utilizar Supertipo de <b>{0}</b> onde possível

source: Change type of <b>{0}</b> to <b>{1}</b>
pt_br: Alterar tipo de <b>{0}</b> para <b>{1}</b>

source: Change return type of <b>{0}</b> to <b>{1}</b>
pt_br: Alterar tipo de retorno de <b>{0}</b> para <b>{1}</b>

source: Change type of local variable(s) <b>{0}</b> to <b>{1}</b>
pt_br: Alterar tipo de variável(is) local(is) <b>{0}</b> para <b>{1}</b>

source: Type {0} is not visible within the body of {1}
pt_br: Tipo {0} não está visível dentro do corpo de {1}

source: Use Supertype can only be invoked on valid types
pt_br: Utilizar Supertipo somente pode ser chamados em tipos válidos

source: No supertype selected.
pt_br: Nenhum supertipo selecionado.

source: Create a new class {0} in package {1} as a copy of {2}
pt_br: Criar uma nova classe {0} no pacote {1} assim como uma cópia de {2}

source: Cannot rename this type of object.
pt_br: Impossível renomear este tipo de objeto.

source: Java package, method, field or class has to be selected.
pt_br: Pacote Java, método, campo ou classe deve estar selecionado.

source: This method overrides or implements methods in super classes/interfaces.
pt_br: Este método substitui ou implementa métodos em classes/interfaces do super.

source: They will also be renamed.
pt_br: Eles também serão renomeados.

source: This method overrides or implements methods in super classes/interfaces, so its name cannot be changed.
pt_br: Este método substitui ou implementa métodos em classes/interfaces do super, entretanto este nome não pode ser alterado.

source: This method overrides or implements a method in {0}.
pt_br: Este método substitui ou implementa um método em {0}.

source: This method is also overridden or implemented in {1}.
pt_br: Este método também é substituído ou implementado em {1}.

source: If you really want to perform this operation, invoke it on the method in {2}.
pt_br: Se você realmente deseja executar esta operação, chame-a no método em {2}.

source: There are methods in subclasses/implementors of {0} that override or implement this method.
pt_br: Existem métodos em subclasses/implementações de {0} que substituem ou implementam este método.

source: After renaming, the original method "{0}" in {1} will be overridden by method "{2}" in {3}.
pt_br: Depois de renomear, o método original "{0}" em {1} será substituído por "{2}" em {3}.

source: After renaming, the original method {0} in {1} will be overridden by method "{2}" in {3} with weaker access privileges.
pt_br: Depois de renomear, o método original {0} em {1} será substituído por "{2}" em {3} com menores privilégios de acesso.

source: After renaming, the original {0} method "{1}" in {2} will be overridden by {3} method "{4}" in {5}.
pt_br: Depois de renomear, o método {0} original "{1}" em {2} será substituído pelo {3} método "{4}" em {5}.

source: After renaming, the original final method "{0}" in {1} will be overridden by method "{2}" in {3}.
pt_br: Depois de renomear, o método original final "{0}" em {1} será substituído por "{2}" em {3}.

source: After renaming, method "{0}" in {1} will override the original method "{2}" in {3}.
pt_br: Depois de renomear, o método "{0}" em {1} irá substituir o método original "{2}" em {3}.

source: After renaming, method {0} in {1} will override the original method "{2}" in {3} with stronger access privileges.
pt_br: Depois de renomar, o método {0} em {1} irá substituir o método original "{2}" em {3} com maiores privilégios de acesso.

source: After renaming, {0} method "{1}" in {2} will override the original {3} method "{4}" in {5}.
pt_br: Depois de renomear, {0} método "{1}" em {2} irá substituir o original {3} método "{4}" em {5}.

source: After renaming, method "{0}" in {1} will override the original final method "{2}" in {3}.
pt_br: Depois de renomear, método "{0}" em {1} irá substituiro método original final "{2}" em {3}.

source: The name has not been modified.
pt_br: O nome não foi modificado.

source: No changes will be performed.
pt_br: Nenhuma alteração será executada.

source: "{0}" is not a valid Java identifier.
pt_br: "{0}" não é um identificador Java válido.

source: "{0}" is not a valid package identifier.
pt_br: "{0}" não é um identificador de pacote válido.

source: Package "{0}" already exists.
pt_br: Pacote "{0}" já existe.

source: Cannot rename.
pt_br: Impossível renomear.

source: Inner class {0} already exists in class {1}.
pt_br: Classe interna {0} já existe na classe {1}.

source: Class {0} already exists in folder {1}.
pt_br: Classe {0} já existe na pasta {1}.

source: Method {0} with the same signature already exists in class {1}.
pt_br: Método {0} com a mesma assinatura já existe na classe {1}.

source: Field {0} already exists in class {1}.
pt_br: Campo {0} já existe na classe {1}.

source: {0} already used.
pt_br: {0} já foi usado.

source: The field to be renamed hides a field in {0}.
pt_br: O campo a ser renomeado esconde um campo em {0}.

source: The new field will hide a field in {0}.
pt_br: O novo campo ocultará um campo em {0}.

source: The name has not been specified.
pt_br: O nome não foi especificado.

source: Cannot move class(es) into the same package.
pt_br: Impossível mover classe(s) dentro do mesmo pacote.

source: Cannot rename element in library file: "{0}".
pt_br: Impossível renomear elemento no arquivo biblioteca: "{0}".

source: Cannot rename method "{0}".
pt_br: Impossível renomear método "{0}".

source: Source file "{1}" not available.
pt_br: Arquivo de origem "{1}" não está disponível.

source: Attempt to rename native method "{0}".
pt_br: Tentativa de renomear método nativo "{0}".

source: Renaming a native method can cause UnsatisfiedLinkError on runtime.
pt_br: Renomear um método nativo pode causar um UnsatisfiedLinkError em tempo de execução.

source: Cannot refactor "{0}".
pt_br: Impossível refatorar "{0}".

source: Rename file
pt_br: Renomear arquivo

source: Cannot search for usages of this type of object.
pt_br: Não pode procurar por utilizações deste tipo de objeto.

source: A Java element has to be selected.
pt_br: Um elemento Java tem que ser selecionado.

source: A target package has not been specified.
pt_br: Um pacote destino não foi especificado.

source: Selected source does not contain any class.
pt_br: Código-fonte selecionado não contém nenhuma classe.

source: You can not move a class from a source file that contains multiple top-level classes.
pt_br: Você não pode mover uma classe de um arquivo de origem que contém múltiplas classes de nível superior.

source: Class "{0}" within the same package is using feature "{1}" of class you want to move ("{2}").
pt_br: A classe "{0}" dentro do mesmo pacote está usando característica "{1}" da classe que você deseja mover ("{2}").

source: Class "{0}" within the same package is using {1} class you want to move ("{2}").
pt_br: A classe "{0}" dentro do mesmo pacote está usando a classe {1} que você deseja mover ("{2}").

source: Class "{0}" within the same package is using {1} constructor declared in class you want to move ("{2}").
pt_br: A classe "{0}" dentro do mesmo pacote está usando o construtor {1} declarado na classe que você deseja mover ("{2}").

source: Class you want to move ("{0}") is using feature "{1}" of class "{2}" within the same package.
pt_br: A classe que você deseja mover ("{0}") está usando característica "{1}" da classe "{2}" dentro do mesmo pacote.

source: Class you want to move ("{0}") is using {1} class ("{2}") within the same package.
pt_br: A classe que você deseja mover ("{0}") está usando a classe {1} ("{2}") dentro do mesmo pacote.

source: Class you want to move ("{0}") is using {1} constructor declared in class ("{2}") within the same package.
pt_br: A classe que você deseja mover ("{0}") está usando o construtor {1} declarado na classe ("{2}") dentro do mesmo pacote.

source: Package "{0}" is read only.
pt_br: Pacote "{0}" é somente leitura.

source: Class "{0}" already exists in the target package.
pt_br: A classe "{0}" já existe no pacote destino.

source: After the move, it will not be possible to import classes in the original default package.
pt_br: Depois de mover, não será possível importar classes no pacote padrão original.

source: If the class is moved to the default package, classes in other packages will not be able to import the moved class.
pt_br: Se a classe é movida para o pacote padrão, classes em outros pacotes serão inabilitadas de importar as classes movidas.

source: File {0} already exists in package {1}.
pt_br: Arquivo {0} já existe no pacote {1}.

source: The parent package has been selected as the destination.
pt_br: Este pacote pai tem que ser selecionado como destino.

source: There are no changes to be performed.
pt_br: Não existe alteração para ser executada.

source: A package cannot be moved into one of its subpackages or into itself.
pt_br: Um pacote não pode ser movido dentro de um destes subpacotes ou dentro dele mesmo.

source: Default package cannot be moved.
pt_br: Pacote padrão não pode ser movido.

source: Cannot move file from library: "{0}".
pt_br: Impossível mover arquivo da biblioteca: "{0}".

source: There are references in project "{0}" to moved files, but source project "{0}" does not depend on target project "{1}".
pt_br: Há referências no projeto "{0}" para mover arquivos, mas o código-fonte do projeto "{0}" não depende do projeto de destino "{1}".

source: Projects need not compile.
pt_br: Projetos não precisam ser compilados.

source: Cannot encapsulate this type of object.
pt_br: Impossível encapsular este tipo de objeto.

source: A field has to be selected.
pt_br: Um campo deve estar selecionado.

source: No field found in {0}.
pt_br: Nenhum campo encontrado em {0}.

source: Cannot encapsulate an interface field.
pt_br: Impossível encapsular um campo interface.

source: Getter and setter names have to be valid method names.
pt_br: Nomes para métodos get's e set's devem ser nomes válidos para método.

source: The accessibility of created methods is private but some selected fields are referenced from other sources.
pt_br: A acessibilidade de criar métodos é privado mas alguns campos selecionados são referenciados de outros códigos-fonte.
